In [20]:
import pandas as pd
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', 100)

# Load dataset

## users.csv

In [4]:
users_df = pd.read_csv(r"data\processed\users_processed.csv")
users_df.sample(5)

,user_id,user_gender,user_age,age_group,country,location,interests,new_user_id
7621,4f630,Female,26,25-34,Japan,East Michaelmouth,fitness,7622
2870,3f8dd,Male,19,18-24,United States,West Lori,"sports, technology",2871
3722,7237d,Female,16,16-17,United Kingdom,West Fernandochester,"news, fitness, gaming",3723
4704,2c6cd,Male,31,25-34,Australia,Port Stevenmouth,"health, food",4705
222,6821c,Female,21,18-24,Germany,Lake Victoriastad,"photography, food",223

## ad_events.csv

In [5]:
ad_events_df = pd.read_csv(r"data\processed\ad_events_processed.csv")
ad_events_df.sample(5)

,event_id,ad_id,user_id,timestamp,day_of_week,time_of_day,event_type,date,time,day,month,quarter,year,hour,minute,second
65059,65060,135,52a3b,03-08-25 2:19,Sunday,Night,Impression,03-08-25,2:19:22,3,8,3,2025,2,19,22
188260,188261,146,40ece,12-06-25 17:52,Thursday,Afternoon,Impression,12-06-25,17:52:31,12,6,2,2025,17,52,31
81283,81284,143,2c4bf,14-06-25 13:10,Saturday,Afternoon,Impression,14-06-25,13:10:53,14,6,2,2025,13,10,53
343711,343712,87,43d8e,23-05-25 0:25,Friday,Night,Click,23-05-25,0:25:42,23,5,2,2025,0,25,42
237469,237470,104,2b870,03-08-25 20:41,Sunday,Evening,Impression,03-08-25,20:41:37,3,8,3,2025,20,41,37

In [6]:
ad_events_df['event_type'].value_counts()

event_type
Impression    339812
Click          40079
Like           12013
Comment         4108
Purchase        2031
Share           1957
Name: count, dtype: int64

## campaigns.csv

In [17]:
campaigns_df = pd.read_csv(r"data\raw\campaigns.csv")
campaigns_df.sample(5)

,campaign_id,name,start_date,end_date,duration_days,total_budget
41,42,Campaign_42_Summer,08-06-25,25-07-25,47,7918.04
23,24,Campaign_24_Summer,30-03-25,23-05-25,54,56692.87
13,14,Campaign_14_Summer,15-04-25,04-06-25,50,39849.94
34,35,Campaign_35_Launch,23-07-25,12-10-25,81,71626.83
24,25,Campaign_25_Winter,07-06-25,04-09-25,89,52725.49

## ads.csv

In [18]:
ads_df = pd.read_csv(r"data\raw\ads.csv")
ads_df.sample(5)

,ad_id,campaign_id,ad_platform,ad_type,target_gender,target_age_group,target_interests
169,170,40,Instagram,Image,Male,35-44,sports
90,91,37,Facebook,Video,All,18-24,"travel, gaming"
148,149,11,Facebook,Stories,All,18-24,"health, fitness"
112,113,15,Instagram,Image,Female,18-24,"fitness, finance"
140,141,44,Instagram,Stories,Male,35-44,travel

# Map old user_id into new user_id

In [7]:
ad_events_df = ad_events_df.merge(
    users_df[['user_id', 'new_user_id']], # get 2 columns user_id and new_user_id from users_df
    on = 'user_id', # join by user_id
    how = 'left' # left join - keep all rows from ad_events_df
)

In [11]:
# Delete user_id column
ad_events_df = ad_events_df.drop('user_id', axis=1)

# Rename new_user_id to user_id
ad_events_df = ad_events_df.rename(columns={'new_user_id': 'user_id'})

In [ ]:
# Change columns order 
cols = ['event_id', 'ad_id', 'user_id', 'timestamp', 'day_of_week', 'time_of_day', 
        'event_type', 'date', 'time', 'day', 'month', 'quarter', 'year', 
        'hour', 'minute', 'second']
ad_events_df = ad_events_df[cols]

In [21]:
ad_events_df.sample(3)

,event_id,ad_id,user_id,timestamp,day_of_week,time_of_day,event_type,date,time,day,month,quarter,year,hour,minute,second
363630,359297,109,5068,20-07-25 19:03,Sunday,Evening,Impression,20-07-25,19:03:29,20,7,3,2025,19,3,29
366066,361707,52,7998,22-06-25 20:44,Sunday,Evening,Impression,22-06-25,20:44:02,22,6,2,2025,20,44,2
101233,100076,37,8845,23-07-25 20:14,Wednesday,Evening,Impression,23-07-25,20:14:00,23,7,3,2025,20,14,0

# Delete user_id column & change new_user_id in users_df

In [22]:
# Delete user_id column
users_df = users_df.drop('user_id', axis=1)

# Rename new_user_id to user_id
users_df = users_df.rename(columns={'new_user_id': 'user_id'})

In [24]:
cols = ['user_id', 'user_gender', 'user_age', 'age_group', 'country', 'location', 'interests']
users_df = users_df[cols]

In [25]:
users_df.sample(3)

,user_id,user_gender,user_age,age_group,country,location,interests
6074,6075,Male,18,18-24,India,Jeremyborough,"health, technology, lifestyle"
1088,1089,Male,24,18-24,United Kingdom,New Sabrina,"health, fitness, lifestyle"
1654,1655,Female,16,16-17,Brazil,Morrismouth,lifestyle

# Save dataset

In [ ]:
# ad_events_df.to_csv(r"data\final\ad_events.csv", index=False)
# users_df.to_csv(r"data\final\users.csv", index=False)
# campaigns_df.to_csv(r"data\final\campaigns.csv", index=False)
# ads_df.to_csv(r"data\final\ads.csv", index=False)